[IRI_Rescue_Denmother_Objective X2ObjectiveTemplate]
Title="Optional: Rescue Denmother"
LocLongDescription="Optional: Rescue Denmother"
SubObjectiveText="Optional: Rescue Denmother"

[IRI_OneGoodEye_Passive X2AbilityTemplate]
LocFriendlyName="One Good Eye"
LocLongDescription="Gain bonus <Ability:IRI_ONE_GOOD_EYE_AIM/> Aim and <Ability:IRI_ONE_GOOD_EYE_CRIT/> Crit when taking multiple primary weapon shots against the same target in a row. Stacks up to <Ability:IRI_ONE_GOOD_EYE_STACKS/> times.<br/>\"I used to be one of the best shots out there. Losing an eye knocked me down a peg, but I can still dish out the pain, as long as I can focus on one target at a time.\""
LocHelpText="Gain bonus <Ability:IRI_ONE_GOOD_EYE_AIM/> Aim and <Ability:IRI_ONE_GOOD_EYE_CRIT/> Crit when taking multiple primary weapon shots against the same target in a row. Stacks up to <Ability:IRI_ONE_GOOD_EYE_STACKS/> times."
LocFlyOverText="One Good Eye"

[IRI_DenmotherRifle X2WeaponTemplate]
FriendlyName="Marksman Carbine"
FriendlyNamePlural="Marksman Carbines"
BriefSummary="This prototype weapon was taken from Argentinian weapons R&D division by Reina \"Denmother\" Morales before she went into hiding with her unit, 601st Commando Company shortly after the First Contact war was over. It packs quite a punch due to using magnetic assistance technology and high caliber caseless match rounds. High velocity soft-point bullets have excellent stopping power, but lack penetration. To help maintain accuracy and conserve ammunition, the carbine is rigged to fire in short bursts. Overcomplicated internal mechanism and the rarity of employed ammunition makes it impractical for replication and mass production."
TacticalText="This prototype weapon was taken from Argentinian weapons R&D division by Reina \"Denmother\" Morales before she went into hiding with her unit, 601st Commando Company shortly after the First Contact war was over. It packs quite a punch due to using magnetic assistance technology and high caliber caseless match rounds. High velocity soft-point bullets have excellent stopping power, but lack penetration. To help maintain accuracy and conserve ammunition, the carbine is rigged to fire in short bursts. Overcomplicated internal mechanism and the rarity of employed ammunition makes it impractical for replication and mass production.<br/><Bullet/> This weapon is ineffective at delivering critical strikes, but high base damage and improved ammunition economy make it a great option for Overwatch duty.<br/><Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Use upgrades looted from enemies to improve the Assault Rifle's tactical effectiveness."
AbilityDescName="assault rifle"


[IRI_GrappleGun X2AbilityTemplate]
LocFriendlyName="Grapple Gun"
LocLongDescription="Keepers can use a Grapple Gun to quickly move to an elevated position or to retrieve loot from the battlefield."
LocHelpText="Use a Grapple Gun to quickly move to an elevated position."
LocPromotionPopupText=""
LocFlyOverText="Grapple Gun"

[IRI_ResupplyAmmo X2AbilityTemplate]
LocFriendlyName="Resupply Ammo"
LocLongDescription="Reload the primary weapon of a targeted allied unit. If this unit is equipped with Experimental Ammo, its effects will be applied to the reloaded weapon until its next regular reload. <Ability:ResupplyAmmoCooldown/> turn cooldown."
LocHelpText="Reload the primary weapon of a targeted allied unit. If equipped with Experimental Ammo, its effects will be applied to the reloaded weapon until its next regular reload."
LocPromotionPopupText="If the target soldier already carries Experimental Ammo, its effects will be temporarily overridden by Keeper's Experimental Ammo."
LocFlyOverText="Resupply Ammo"

[IRI_SupplyRun X2AbilityTemplate]
LocFriendlyName="Supply Run"
LocLongDescription="Using Resupply Ammo or Bandage Throw on an ally grants a Move-only action point."
LocHelpText="Using Resupply Ammo or Bandage Throw on an ally grants a Move-only action point."
LocPromotionPopupText=""
LocFlyOverText="Supply Run"

[IRI_PullLoot X2AbilityTemplate]
LocFriendlyName="Grapple Loot"
LocLongDescription="Use a Grapple Gun to retrieve loot from the battlefield."
LocHelpText="Use a Grapple Gun to retrieve loot from the battlefield."
LocPromotionPopupText=""
LocFlyOverText="Grapple Loot"

[IRI_PullAlly X2AbilityTemplate]
LocFriendlyName="Reposition"
LocLongDescription="Use a Grapple Gun to pull an allied unit towards your position, preferring tiles in cover. <Ability:PullAllyCooldown/> turn cooldown."
LocHelpText="Use a Grapple Gun to pull an allied unit towards your position."
LocPromotionPopupText=""
LocFlyOverText="Reposition"

[IRI_BandageThrow X2AbilityTemplate]
LocFriendlyName="Bandage Throw"
LocLongDescription="Provide an ally with a pack of bandages to stop bleeding effects and heal them for <Ability:BandageThrowHeal/> HP each turn for <Ability:BandageThrowDuration/> turns. <Ability:BandageThrowCharges/> uses per mission. <Ability:BandageThrowCooldown/> turn cooldown."
LocHelpText="Provide an ally with a pack of bandages to stop bleeding effects and heal them for <Ability:BandageThrowHeal/> HP each turn for <Ability:BandageThrowDuration/> turns."
LocPromotionPopupText="<bullet/> The target has to be conscious and able to act in order to be able to use the bandages.<br/><bullet/> <Ability:BandageThrow_EmpowerTechName/> tech improves the Bandage's heal to <Ability:BandageThrowHealEmpowered/> HP per tick.<br/>"
LocFlyOverText="Bandage Throw"


[Keeper X2SoldierClassTemplate]
DisplayName="Keeper"
ClassSummary="Keepers are experts in the field of military logistics. They keep their allies supplied and lock down their enemies with defensive tactics and rapid reaction fire."
LeftAbilityTreeTitle="Overseer"
RightAbilityTreeTitle="Logistician"
AbilityTreeTitles[0]="Overseer"
AbilityTreeTitles[1]="Logistician"
AbilityTreeTitles[2]="XCOM"

;RandomNickNames[0]="Apex"

[IRI_Keeper_GTS_Unlock X2SoldierAbilityUnlockTemplate]
DisplayName="Keeper: Steady Hands"
Summary="Gain the ability to train rookies as Keepers in Guerilla Tactics School. All Keepers gain the Steady Hands ability."

[IRI_Encyclopedia_Denmother_Good X2EncyclopediaTemplate]
ListTitle="Personnel Dossier: Reina \"Denmother\" Morales"
DescriptionTitle="Morales, Reina - STATUS: ACTIVE"
DescriptionEntry="Born est. 1989, Mendoza, Argentina, Reina was raised in the eastern parts of the Andean mountain range. First Contact war struck when she was 16. She and her parents were caught in the middle of an alien abduction. At that time XCOM chose to give priority to another abduction location, so first responders on scene were units of the Argentina's 601st Commando Company, AFOE (Special Operations Force Grouping). At the cost of heavy losses they managed to evacuate some of the civilians, including Reina, but not her parents, who got separated from her in the ensued chaos.\n\nReina and several other civilians were being escorted to an evacuation chopper by a fireteam of two SOFG operatives when they came under plasma fire from a group of Sectoids. One of the operatives was shot and killed instantly, the other one was wounded in a leg. He took a defensive position, and yelled at the civilians to run for their lives to the chopper, while he would provide covering fire. Reina instead chose to pick up the rifle of the fallen operative and help cover the civilians' escape. That gave time to the other operative to call for reinforcements, and they were barely able to hold out until a column of Norinco APCs has driven away the Sectoids.\n\nThe surviving operative, who turned out to be a captain with the 601st, has thanked Reina for saving his life and commended on her bravery, and told her she could \"ask for anything\". She called in her chip shortly after identifying her parents' bodies among the casualties, and demanded to join the 601st to take revenge on the aliens. She has also lied about her age. Reluctantly, the captain agreed.\n\nReina has begun training with the 601st, but was not allowed to participate in military operations. The Argentinian government has surrendered to the ADVENT administration a few months later. The commanding officer of the 601st has decided to continue fighting from underground. Expecting to not receive government support anymore, he has ordered the unit to raid a military storage depot to stock up on supplies and munitions. Reina's squad has broken into the stores of an experimental weapons R&D division, where Reina has \"borrowed\" an experimental Marksman Carbine.\n\nThe 601st have made several attempts at the insurgency, but they always inevitably ended in most of the deployed operatives being butchered by vastly numerically superior ADVENT troops. Condemned by - formerly - their own government as terrorists, the remnants of the SOFG were eventually forced into permanent hiding. Reina has took charge of refugees from ADVENT-controlled cities, and has continued her marksmanship training, hoping to put it to good use one day.\n\nBy the time the remnants of the XCOM project were able to recover their commander and relaunch the Avenger two decades later, Reina was in charge of a whole haven of civilian refugees, located in the Chilean Andes. Reina was nicknamed \"Denmother\" for her ferocity in protecting those under her care. She got married and gave birth to a daughter, and gotten used to the harsh, but relatively peaceful life in the haven, and considered herself too old and too grounded to rejoin the active resistance, and started believing that if they would not take aggressive action, then maybe the ADVENT administration would allow them to live in peace. ADVENT has proven her wrong when they launched a surprise attack on her haven. Reina was incapacitated when the attack began, while XCOM has immediately scrambled a rapid response team.\n\nXCOM operatives were able to provide medical aid to \"Denmother\" and neutralized the ADVENT offensive, rescuing Reina's family in the process. \"Denmother\" has realized that her \"live and let live\" policy is not shared by ADVENT administration, who will open with unprovoked lethal force, and requested that upon recovering from her wounds she will be allowed to join the XCOM operative roster in order to fight for her family and the Earth as a whole."

[IRI_Encyclopedia_Denmother_Bad X2EncyclopediaTemplate]
ListTitle="Personnel Dossier: Reina \"Denmother\" Morales"
DescriptionTitle="Morales, Reina - STATUS: ACTIVE"
DescriptionEntry="Born est. 1989, Mendoza, Argentina, Reina was raised in the eastern parts of the Andean mountain range. First Contact war struck when she was 16. She and her parents were caught in the middle of an alien abduction. At that time XCOM chose to give priority to another abduction location, so first responders on scene were units of the Argentina's 601st Commando Company, AFOE (Special Operations Force Grouping). At the cost of heavy losses they managed to evacuate some of the civilians, including Reina, but not her parents, who got separated from her in the ensued chaos.\n\nReina and several other civilians were being escorted to an evacuation chopper by a fireteam of two SOFG operatives when they came under plasma fire from a group of Sectoids. One of the operatives was shot and killed instantly, the other one was wounded in a leg. He took a defensive position, and yelled at the civilians to run for their lives to the chopper, while he would provide covering fire. Reina instead chose to pick up the rifle of the fallen operative and help cover the civilians' escape. That gave time to the other operative to call for reinforcements, and they were barely able to hold out until a column of Norinco APCs has driven away the Sectoids.\n\nThe surviving operative, who turned out to be a captain with the 601st, has thanked Reina for saving his life and commended on her bravery, and told her she could \"ask for anything\". She called in her chip shortly after identifying her parents' bodies among the casualties, and demanded to join the 601st to take revenge on the aliens. She has also lied about her age. Reluctantly, the captain agreed.\n\nReina has begun training with the 601st, but was not allowed to participate in military operations. The Argentinian government has surrendered to the ADVENT administration a few months later. The commanding officer of the 601st has decided to continue fighting from underground. Expecting to not receive government support anymore, he has ordered the unit to raid a military storage depot to stock up on supplies and munitions. Reina's squad has broken into the stores of an experimental weapons R&D division, where Reina has \"borrowed\" an experimental Marksman Carbine.\n\nThe 601st have made several attempts at the insurgency, but they always inevitably ended in most of the deployed operatives being butchered by vastly numerically superior ADVENT troops. Condemned by - formerly - their own government as terrorists, the remnants of the SOFG were eventually forced into permanent hiding. Reina has took charge of refugees from ADVENT-controlled cities, and has continued her marksmanship training, hoping to put it to good use one day.\n\nBy the time the remnants of the XCOM project were able to recover their commander and relaunch the Avenger two decades later, Reina was in charge of a whole haven of civilian refugees, located in the Chilean Andes. Reina was nicknamed \"Denmother\" for her ferocity in protecting those under her care. She got married and gave birth to a daughter, and gotten used to the harsh, but relatively peaceful life in the haven, and considered herself too old and too grounded to rejoin the active resistance, and started believing that if they would not take aggressive action, then maybe the ADVENT administration would allow them to live in peace. ADVENT has proven her wrong when they launched a surprise attack on her haven. Reina was incapacitated when the attack began, while XCOM has immediately scrambled a rapid response team.\n\nXCOM operatives were able to provide medical aid to Reina in time. Unfortunately, many civilians have perished, including Reina's family. Fighting through feelings of regret and bitter loss, \"Denmother\" has requested that upon recovering from her wounds she will be allowed to join the XCOM operative roster, so she can avenge her family and help bring the end to the occupation of the Earth, so that nobody else has to experience the loss similar to hers."

[IRI_Encyclopedia_Denmother_Dead X2EncyclopediaTemplate]
ListTitle="Personnel Dossier: Reina \"Denmother\" Morales"
DescriptionTitle="Morales, Reina - STATUS: KIA"
DescriptionEntry="Born est. 1989, Mendoza, Argentina, Reina was raised in the eastern parts of the Andean mountain range. First Contact war struck when she was 16. She and her parents were caught in the middle of an alien abduction. At that time XCOM chose to give priority to another abduction location, so first responders on scene were units of the Argentina's 601st Commando Company, AFOE (Special Operations Force Grouping). At the cost of heavy losses they managed to evacuate some of the civilians, including Reina, but not her parents, who got separated from her in the ensued chaos.\n\nReina and several other civilians were being escorted to an evacuation chopper by a fireteam of two SOFG operatives when they came under plasma fire from a group of Sectoids. One of the operatives was shot and killed instantly, the other one was wounded in a leg. He took a defensive position, and yelled at the civilians to run for their lives to the chopper, while he would provide covering fire. Reina instead chose to pick up the rifle of the fallen operative and help cover the civilians' escape. That gave time to the other operative to call for reinforcements, and they were barely able to hold out until a column of Norinco APCs has driven away the Sectoids.\n\nThe surviving operative, who turned out to be a captain with the 601st, has thanked Reina for saving his life and commended on her bravery, and told her she could \"ask for anything\". She called in her chip shortly after identifying her parents' bodies among the casualties, and demanded to join the 601st to take revenge on the aliens. She has also lied about her age. Reluctantly, the captain agreed.\n\nReina has begun training with the 601st, but was not allowed to participate in military operations. The Argentinian government has surrendered to the ADVENT administration a few months later. The commanding officer of the 601st has decided to continue fighting from underground. Expecting to not receive government support anymore, he has ordered the unit to raid a military storage depot to stock up on supplies and munitions. Reina's squad has broken into the stores of an experimental weapons R&D division, where Reina has \"borrowed\" an experimental Marksman Carbine.\n\nThe 601st have made several attempts at the insurgency, but they always inevitably ended in most of the deployed operatives being butchered by vastly numerically superior ADVENT troops. Condemned by - formerly - their own government as terrorists, the remnants of the SOFG were eventually forced into permanent hiding. Reina has took charge of refugees from ADVENT-controlled cities, and has continued her marksmanship training, hoping to put it to good use one day.\n\nBy the time the remnants of the XCOM project were able to recover their commander and relaunch the Avenger two decades later, Reina was in charge of a whole haven of civilian refugees, located in the Chilean Andes. Reina was nicknamed \"Denmother\" for her ferocity in protecting those under her care. She got married and gave birth to a daughter, and gotten used to the harsh, but relatively peaceful life in the haven, and considered herself too old and too grounded to rejoin the active resistance, and started believing that if they would not take aggressive action, then maybe the ADVENT administration would allow them to live in peace. ADVENT has proven her wrong when they launched a surprise attack on her haven. Reina was incapacitated when the attack began, while XCOM has immediately scrambled a rapid response team.\n\nUnfortunately, it was not possible for XCOM operatives to recover her, and Reina has been K.I.A."

;	=================
;This file was generated by the XCOM Mod File Generator by @cjrcodes on Github and Instagram
;If you would like to contribute or leave feedback, visit https://github.com/cjrcodes/XCOM-Mod-File-Generator 
;To generate new files, visit https://cjrcodes.github.io/XCOM-Mod-File-Generator/

[WOTCRescueDenmother_Torso_KV_F X2BodyPartTemplate]
DisplayName="Denmother's Jacket"

[WOTCRescueDenmother_TorsoWithGear_KV_F X2BodyPartTemplate]
DisplayName="Denmother's Vest"

[WOTCRescueDenmother_Arms_KV_F X2BodyPartTemplate]
DisplayName="Denmother's Arms"

[WOTCRescueDenmother_Legs_KV_F X2BodyPartTemplate]
DisplayName="Denmother's Legs"

[WOTCRescueDenmother_Helmets_F X2BodyPartTemplate]
DisplayName="Denmother's Beanie"

[WOTCRescueDenmother_TorsoDeco_Gear_KV_F X2BodyPartTemplate]
DisplayName="Denmother's Tactical Gear"

[WOTCRescueDenmother_TorsoDeco_Backpack_KV_F X2BodyPartTemplate]
DisplayName="Denmother's Backpack"
